balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1946.PIC
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="CM3CON1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="CM3CON1" edc:nzwidth="0x8" edc:por="0000--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C3NCH0" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C3NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH1" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C3NCH1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C3PCH0" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C3PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH1" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C3PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C3INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C3INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3NCH" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x3" edc:name="C3NCH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C3PCH" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x3" edc:name="C3PCH" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--n-nnnn" edc:cname="ANSELA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--1-1111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="--1-1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA5" edc:desc="" edc:mask="0x1" edc:name="ANSA5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELA" edc:desc="" edc:mask="0x3f" edc:name="ANSELA" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ANSELE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ANSELE" edc:nzwidth="0x8" edc:por="-----111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSE0" edc:desc="" edc:mask="0x1" edc:name="ANSE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSE1" edc:desc="" edc:mask="0x1" edc:name="ANSE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSE2" edc:desc="" edc:mask="0x1" edc:name="ANSE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELE" edc:desc="" edc:mask="0x7" edc:name="ANSELE" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="EEADR" edc:desc="" edc:name="EEADR" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EEADRL" edc:nzwidth="0x8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EEADRL" edc:desc="" edc:mask="0xff" edc:name="EEADRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-nnnnnnn" edc:cname="EEADRH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="EEADRH" edc:nzwidth="0x8" edc:por="10000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="EEADRH" edc:desc="" edc:mask="0x7f" edc:name="EEADRH" edc:nzwidth="7"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
